Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes.UseDigitGrouping Property
 Gets or sets a value indicating whether digit grouping should be used or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseDigitGrouping { get; set; }
Public Property UseDigitGrouping As Boolean
	Get
	Set
Property Value
Type: Boolean
Examples
 The following example shows how the property works:
true: 123 456.789
false: 123456.789
See Also
Reference
DimensionSetBaseAttributes.DimensionFormatAttributes Class
Tekla.Structures.Drawing Namespace